<?php
// +----------------------------------------------------------------------
// | 验证码设置
// +----------------------------------------------------------------------

return [
    // 验证码字符集合
    'codeSet'       => '234569',
    // 验证码字体大小
    'fontSize'      => 16,
    // 验证码位数
    'length'        => 3,
    // 验证码杂点
    'useNoise'      => 1,
    // 验证码过期时间（s）
    'expire'        => 300,
    // 使用中文验证码
    'useZh'         => false,
    // 中文验证码字符串
    'zhSet'         => '',
    // 是否画混淆曲线
    'useCurve'      => 0,
    // 验证码图片高度，设置为0为自动计算
    'imageH'        => 30,
    // 验证码图片宽度，设置为0为自动计算
    'imageW'        => 90,
    // 背景颜色
    'bg'            => [255,255,255],
    // 验证成功后是否重置
    'reset'         => true
];